In [3]:
import numpy as np 
import pandas as pd

In [ ]:
* Below method will take dataframe and  column name and replace NaN values with given list .

In [2]:
def replace_nan_with_random_list(df, column, replacement_list):
    nan_indices = df.index[df[column].isna()].tolist()
    num_nans = len(nan_indices)
    random_values = np.random.choice(replacement_list, size=num_nans)
    df.loc[nan_indices, column] = random_values

* Below method will take dataframe and  column name and replace NaN values with non NAN values from that column.
  It will select a random value from non NAN value

In [26]:
def replace_nan_with_existing_val(df, column):
    nan_indices = df.index[df[column].isna()].tolist()
    num_nans = len(nan_indices)
    # check where values are not Nan values , that will make a replacement_list
    value_index = df.index[df.A.notna()].tolist()
    replacement_list = df.loc[value_index,'A'].values.tolist()
    random_values = np.random.choice(replacement_list, size=num_nans)
    df.loc[nan_indices, column] = random_values

In [4]:
data = {'A': [1, 2, np.nan, 4, 5, np.nan, 7, 8, 9]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     A
0  1.0
1  2.0
2  NaN
3  4.0
4  5.0
5  NaN
6  7.0
7  8.0
8  9.0

In [11]:
# got the NaN index
nan_index = df.index[df.A.isna()].tolist()
len(nan_index)

2

In [12]:
# got the non nan index
value_index = df.index[df.A.notna()].tolist()
len(value_index)

7

In [18]:
replacement_list = df.loc[value_index,'A'].values.tolist()

In [19]:
replacement_list

[1.0, 2.0, 4.0, 5.0, 7.0, 8.0, 9.0]

In [20]:
replace_nan_with_random_list(df,'A',replacement_list=replacement_list)

In [21]:
df

     A
0  1.0
1  2.0
2  8.0
3  4.0
4  5.0
5  7.0
6  7.0
7  8.0
8  9.0

In [24]:
data2 = { 'A' : [ 77 , 88 ,99 , np.nan, 110 , 122, 133, np.nan] }
df2 = pd.DataFrame(data2)
df2

       A
0   77.0
1   88.0
2   99.0
3    NaN
4  110.0
5  122.0
6  133.0
7    NaN

In [27]:
%whos

Variable                        Type         Data/Info
------------------------------------------------------
data                            dict         n=1
data2                           dict         n=1
df                              DataFrame         A\n0  1.0\n1  2.0\n2<...>0\n6  7.0\n7  8.0\n8  9.0
df2                             DataFrame           A\n0   77.0\n1   8<...>122.0\n6  133.0\n7    NaN
nan_index                       list         n=2
np                              module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
pd                              module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
replace_nan_with_existing_val   function     <function replace_nan_wit<...>al at 0x00000205CCC4FEE0>
replace_nan_with_random_list    function     <function replace_nan_wit<...>st at 0x00000205B457BDC0>
replacement_list                list         n=7
value_index                     list         n=7

In [29]:
# replace NAN with existing values in the dataframe 
replace_nan_with_existing_val (df2,'A')

In [30]:
df2

       A
0   77.0
1   88.0
2   99.0
3   88.0
4  110.0
5  122.0
6  133.0
7  133.0